## Aggregation Functions
1. Write a query that calculates the total cost of all animal rescues in the PETRESCUE table.

For this query, we will use the function SUM(COLUMN_NAME). The output of this query will be the total value of all elements in the column. The query for this question can be written as:

In [1]:
import mysql.connector

cn=mysql.connector.connect(host='localhost',user='root',password='Vibha.7522')
cursor=cn.cursor()

In [2]:
cursor.execute("use petrescue")

In [3]:
cursor.execute("SELECT SUM(COST) FROM PETRESCUE")
cursor.fetchall()

[(Decimal('1718.24'),)]

You can further assign a label to the query SUM_OF_COST.

In [4]:
cursor.execute("SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE")
cursor.fetchall()

[(Decimal('1718.24'),)]

2. Write a query that displays the maximum quantity of animals rescued (of any kind).

For this query, we will use the function MAX(COLUMN_NAME). The output of this query will be the maximum value of all elements in the column. The query for this question can be written as:

In [5]:
cursor.execute("SELECT MAX(QUANTITY) FROM PETRESCUE")
cursor.fetchall()

[(24,)]

The query can easily be changed to display the minimum quantity using the MIN function instead.

In [6]:
cursor.execute("SELECT MIN(QUANTITY) FROM PETRESCUE")
cursor.fetchall()

[(1,)]

3. Write a query that displays the average cost of animals rescued.

For this query, we will use AVG(COLUMN_NAME). The output of this query will be the average of all elements in the column. The query for this question can be written as

In [7]:
cursor.execute("SELECT AVG(COST) FROM PETRESCUE")
cursor.fetchall()

[(Decimal('190.915556'),)]

## Scalar Functions and String Functions
1. Write a query that displays the rounded integral cost of each rescue.

For this query, we will use the function ROUND(COLUMN_NAME, NUMBER_OF_DECIMALS). The output of this query will be the value of each element in the column rounded to the specified number of decimal places. Note that the second argument is optional and, if omitted, results in rounding to an integer value. The query for this question can be written as:

In [8]:
cursor.execute("SELECT ROUND(COST) FROM PETRESCUE")
cursor.fetchall()

[(Decimal('450'),),
 (Decimal('667'),),
 (Decimal('100'),),
 (Decimal('50'),),
 (Decimal('76'),),
 (Decimal('61'),),
 (Decimal('44'),),
 (Decimal('48'),),
 (Decimal('222'),)]

In [9]:
cursor.execute("SELECT ROUND(COST, 0) FROM PETRESCUE")
cursor.fetchall()

[(Decimal('450'),),
 (Decimal('667'),),
 (Decimal('100'),),
 (Decimal('50'),),
 (Decimal('76'),),
 (Decimal('61'),),
 (Decimal('44'),),
 (Decimal('48'),),
 (Decimal('222'),)]

In case the question was to round the value to 2 decimal places, the query would change to:

In [10]:
cursor.execute("SELECT ROUND(COST, 2) FROM PETRESCUE")
cursor.fetchall()

[(Decimal('450.09'),),
 (Decimal('666.66'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('75.75'),),
 (Decimal('60.60'),),
 (Decimal('44.44'),),
 (Decimal('48.48'),),
 (Decimal('222.22'),)]

2. Write a query that displays the length of each animal name.

For this query, we will use the function LENGTH(COLUMN_NAME). The output of this query will be the length of each element in the column. The query for this question can be written as:

In [11]:
cursor.execute("SELECT LENGTH(ANIMAL) FROM PETRESCUE")
cursor.fetchall()

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

3. Write a query that displays the animal name in each rescue in uppercase.

For this query, we will use the function UCASE(COLUMN_NAME). The output of this query will be each element in the column in upper case letters. The query for this question can be written as:

In [12]:
cursor.execute("SELECT UCASE(ANIMAL) FROM PETRESCUE")
cursor.fetchall()

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

Just as easily, the user could ask for a lower case representation, and the query would be changed to:

In [13]:
cursor.execute("SELECT LCASE(ANIMAL) FROM PETRESCUE")
cursor.fetchall()

[('cat',),
 ('dog',),
 ('dog',),
 ('parrot',),
 ('dog',),
 ('hamster',),
 ('cat',),
 ('goldfish',),
 ('dog',)]

## Date Functions
1. Write a query that displays the day of the month when cats have been rescued.

For this query, we will use the function DAY(COLUMN_NAME). The output of this query will be only the DAY part of the date in the column. The query for this question can be written as:

In [14]:
cursor.execute("SELECT DAY(RESCUEDATE) FROM PETRESCUE")
cursor.fetchall()

[(29,), (1,), (4,), (4,), (10,), (11,), (11,), (14,), (15,)]

In case the query was asking for MONTH of rescue, the query would change to:

In [15]:
cursor.execute("SELECT MONTH(RESCUEDATE) FROM PETRESCUE")
cursor.fetchall()

[(5,), (6,), (6,), (6,), (6,), (6,), (6,), (6,), (6,)]

In case the query was asking for YEAR of rescue, the query would change to:

In [16]:
cursor.execute("SELECT YEAR(RESCUEDATE) FROM PETRESCUE")
cursor.fetchall()

[(2018,),
 (2018,),
 (2018,),
 (2018,),
 (2018,),
 (2018,),
 (2018,),
 (2018,),
 (2018,)]

2. Animals rescued should see the vet within three days of arrival. Write a query that displays the third day of each rescue.

For this query, we will use the function DATE_ADD(COLUMN_NAME, INTERVAL Number Date_element). Here, the quantity in Number and in Date_element will combine to form the interval to be added to the date in the column. For the given question, the query would be:

In [17]:
cursor.execute("SELECT DATE_ADD(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE")
cursor.fetchall()

[(datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 4),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 13),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 17),),
 (datetime.date(2018, 6, 18),)]

If the question was to add 2 months to the date, the query would change to:

In [18]:
cursor.execute("SELECT DATE_ADD(RESCUEDATE, INTERVAL 2 MONTH) FROM PETRESCUE")
cursor.fetchall()

[(datetime.date(2018, 7, 29),),
 (datetime.date(2018, 8, 1),),
 (datetime.date(2018, 8, 4),),
 (datetime.date(2018, 8, 4),),
 (datetime.date(2018, 8, 10),),
 (datetime.date(2018, 8, 11),),
 (datetime.date(2018, 8, 11),),
 (datetime.date(2018, 8, 14),),
 (datetime.date(2018, 8, 15),)]

Similarly, we can retrieve a date before the one given in the column by a given number using the function DATE_SUB. By modifying the same example, the following query would provide the date 3 days before the rescue.

In [19]:
cursor.execute("SELECT DATE_SUB(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE")
cursor.fetchall()

[(datetime.date(2018, 5, 26),),
 (datetime.date(2018, 5, 29),),
 (datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 8),),
 (datetime.date(2018, 6, 8),),
 (datetime.date(2018, 6, 11),),
 (datetime.date(2018, 6, 12),)]

3. Write a query that displays the length of time the animals have been rescued, for example, the difference between the current date and the rescue date.

For this query, we will use the function DATEDIFF(Date_1, Date_2). This function calculates the difference between the two given dates and gives the output in number of days. For the given question, the query would be:

In [20]:
cursor.execute("SELECT DATEDIFF(CURRENT_DATE, RESCUEDATE) FROM PETRESCUE")
cursor.fetchall()

[(2002,),
 (1999,),
 (1996,),
 (1996,),
 (1990,),
 (1989,),
 (1989,),
 (1986,),
 (1985,)]

CURRENT_DATE is also an inbuilt function that returns the present date as known to the server.

To present the output in a YYYY-MM-DD format, another function FROM_DAYS(number_of_days)can be used. This function takes a number of days and returns the required formatted output. The query above would thus be modified to

In [21]:
cursor.execute("SELECT FROM_DAYS(DATEDIFF(CURRENT_DATE, RESCUEDATE)) FROM PETRESCUE")
cursor.fetchall()

[(datetime.date(5, 6, 25),),
 (datetime.date(5, 6, 22),),
 (datetime.date(5, 6, 19),),
 (datetime.date(5, 6, 19),),
 (datetime.date(5, 6, 13),),
 (datetime.date(5, 6, 12),),
 (datetime.date(5, 6, 12),),
 (datetime.date(5, 6, 9),),
 (datetime.date(5, 6, 8),)]

## Practice Problems
1. Write a query that displays the average cost of rescuing a single dog. Note that the cost per dog would not be the same in different instances.

In [ ]:
SELECT AVG(COST/QUANTITY) FROM PETRESCUE WHERE ANIMAL = 'Dog'

2. Write a query that displays the animal name in each rescue in uppercase without duplications.

In [ ]:
SELECT DISTINCT UCASE(ANIMAL) FROM PETRESCUE

3. Write a query that displays all the columns from the PETRESCUE table where the animal(s) rescued are cats. Use cat in lowercase in the query.

In [ ]:
SELECT * FROM PETRESCUE WHERE LCASE(ANIMAL)="cat"

4. Write a query that displays the number of rescues in the 5th month.

In [ ]:
SELECT SUM(QUANTITY) FROM PETRESCUE WHERE MONTH(RESCUEDATE)="05"

5. The rescue shelter is supposed to find good homes for all animals within 1 year of their rescue. Write a query that displays the ID and the target date.

In [ ]:
SELECT ID, DATE_ADD(RESCUEDATE, INTERVAL 1 YEAR) FROM PETRESCUE

## Sub-queries and Nested Selects

Say you are asked to retrieve all employee records whose salary is lower than the average salary. You might use the following query to do this.

In [3]:
cursor.execute("use HR_Database")

In [ ]:
cursor.execute("select * from employees where salary<avg(salary)")
cursor.fetchall()

However, this query will generate an error stating, "Illegal use of group function." Here, the group function is AVG and cannot be used directly in the condition since it has not been retrieved from the data. Therefore, the condition will use a sub-query to retrieve the average salary information to compare the existing salary. The modified query would become:

In [6]:
cursor.execute("select * from employees where salary<(select avg(salary) from employees)")
cursor.fetchall()

[('E1003',
  'Steve',
  'Wells',
  '123458',
  datetime.date(1980, 10, 8),
  'M',
  '291 Springs, Gary,IL',
  '300',
  Decimal('50000.00'),
  '30002',
  '5'),
 ('E1004',
  'Santosh',
  'Kumar',
  '123459',
  datetime.date(1985, 7, 20),
  'M',
  '511 Aurora Av, Aurora,IL',
  '400',
  Decimal('60000.00'),
  '30002',
  '5'),
 ('E1005',
  'Ahmed',
  'Hussain',
  '123410',
  datetime.date(1981, 4, 1),
  'M',
  '216 Oak Tree, Geneva,IL',
  '500',
  Decimal('70000.00'),
  '30001',
  '2'),
 ('E1007',
  'Mary',
  'Thomas',
  '123412',
  datetime.date(1975, 5, 5),
  'F',
  '100 Rose Pl, Gary,IL',
  '650',
  Decimal('65000.00'),
  '30003',
  '7'),
 ('E1008',
  'Bharath',
  'Gupta',
  '123413',
  datetime.date(1985, 6, 5),
  'M',
  '145 Berry Ln, Naperville,IL',
  '660',
  Decimal('65000.00'),
  '30003',
  '7'),
 ('E1009',
  'Andrea',
  'Jones',
  '123414',
  datetime.date(1990, 9, 7),
  'F',
  '120 Fall Creek, Gary,IL',
  '234',
  Decimal('70000.00'),
  '30003',
  '7'),
 ('E1010',
  'Ann',
  'Jacob',
  '123415',
  datetime.date(1982, 3, 30),
  'F',
  '111 Britany Springs,Elgin,IL',
  '220',
  Decimal('70000.00'),
  '30002',
  '5')]

Now, consider executing a query that retrieves all employee records with EMP_ID, SALARY, and maximum salary as MAX_SALARY in every row. For this, the maximum salary must be queried and used as one of the columns. This can be done using the query below.

In [ ]:
SELECT EMP_ID, SALARY, (SELECT MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY 
FROM EMPLOYEES;

Now, consider that you wish to extract the first and last names of the oldest employee. Since the oldest employee will be the one with the smallest date of birth, the query can be written as:

In [ ]:
SELECT f_name, l_name FROM employees WHERE DOB=(SELECT MIN(DOB) FROM employees)

You may also use sub-queries to create derived tables, which can then be used to query specific information. Say you want to know the average salary of the top 5 earners in the company. You will first have to extract a table of the top five salaries as a table. From that table, you can query the average value of the salary. The query can be written as follows.

In [ ]:
SELECT AVG(SALARY) 
FROM (SELECT SALARY 
      FROM EMPLOYEES 
      ORDER BY SALARY DESC 
      LIMIT 5) AS SALARY_TABLE;

## Practice Problems
1. Write a query to find the average salary of the five least-earning employees.

In [ ]:
select avg(avg_salary) 
from (select salary 
      from employees 
      order by salary limit 5) as avg_salary

2. Write a query to find the records of employees older than the average age of all employees.

Age in years can be calculated as the year component in the difference between DOB and current date. You need to compare the age in years with average age in years. The average age in years will be evaluated as a sub-query.

In [ ]:
SELECT * 
FROM EMPLOYEES 
WHERE YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE,BirthDate))) > 
    (SELECT AVG(YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE,BirthDate)))) 
    FROM Employees);

3. From the Job_History table, display the list of Employee IDs, years of service, and average years of service for all entries.

For this, you need to calculate the years of service as a difference between the date of joining and the current date. Average years of service need to be queried separately to be displayed.

In [ ]:
SELECT EMPL_ID, YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE, STARTDATE))), 
    (SELECT AVG(YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE, STARTDATE)))) 
    FROM JOB_HISTORY)
FROM JOB_HISTORY;

You should now be able to:

Write SQL queries that demonstrate the necessity of using sub-queries

Compose sub-queries in the WHERE clause

Build Column Expressions (for example, sub-query in place of a column)

Write Table Expressions (for example, sub-query in place of a table)